#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть значение радиуса круга
radius = 42

# Вычисляем площадь круга
pi = 3.1415926
area = pi * (radius ** 2)

# Выводим площадь с точностью до 4-х знаков после запятой
print(round(area, 4))

# Далее, пусть есть координаты точки
point_1 = (23, 34)

# Определяем расстояние от точки до начала координат (0, 0)
distance_1 = (point_1[0] ** 2 + point_1[1] ** 2) ** 0.5

# Проверяем, находится ли точка внутри круга
is_inside_1 = distance_1 <= radius
print(is_inside_1)

# Аналогично для другой точки
point_2 = (30, 30)

# Определяем расстояние от точки до начала координат (0, 0)
distance_2 = (point_2[0] ** 2 + point_2[1] ** 2) ** 0.5

# Проверяем, находится ли точка внутри круга
is_inside_2 = distance_2 <= radius
print(is_inside_2)